#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/statuc_devops/armageddon-github-actions/runs/run-pnZmmxb5qdUw9yBR

Waiting for the plan to start...

Terraform v1.10.4
on linux_amd64
Initializing plugins and modules...
data.aws_ami.latest-amazon-linux-image: Refreshing...
aws_eip.eip_NY: Refreshing state... [id=eipalloc-0935e44c532db094d]
aws_vpc.VPC-B-NewYork-Test: Refreshing state... [id=vpc-03bdc81ebb8aa64c0]
data.aws_ami.latest-amazon-linux-image: Refresh complete after 1s [id=ami-0df8c184d5f6ae949]
aws_internet_gateway.igw_NY: Refreshing state... [id=igw-0544cdbd7fa7c4687]
aws_subnet.public-us-east-1b: Refreshing state... [id=subnet-08d59214d72816e37]
aws_subnet.private-us-east-1b: Refreshing state... [id=subnet-0bec145c5fe625d73]
aws_subnet.private-us-east-1a: Refreshing state... [id=subnet-05e2095dd6c41961d]
aws_lb_target_group.ASG01_NY_TG01: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:261519058382:targetgroup/ASG01-NewYork-target-group/98be57dfe53e8914]
aws_security_group.ASG01-SG02-NY-TG80: Refreshing state... [id=sg-0d8d2b357188c58e0]
aws_subnet.public-us-east-1a: Refreshing state... [id=subnet-04fe3bef98dae10ac]
aws_security_group.ASG01-SG01-NY-LB01: Refreshing state... [id=sg-0292efcbc48efb1c1]
aws_security_group.ASG01-SG03-NY-servers: Refreshing state... [id=sg-015df5ad402f79620]
aws_route_table.public_NY: Refreshing state... [id=rtb-039a80d93cdc9ed62]
aws_launch_template.app1_NewYork_LT: Refreshing state... [id=lt-0438d32c9b9ad1c3f]
aws_nat_gateway.nat_NY: Refreshing state... [id=nat-0fdcd13a55506ed78]
aws_lb.ASG01-NY-LB01: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:261519058382:loadbalancer/app/ASG01-NewYork-load-balancer/dcc5e91b8a764662]
aws_route_table_association.public-us-east-1b: Refreshing state... [id=rtbassoc-03253afcba4d449f8]
aws_route_table_association.public-us-east-1a: Refreshing state... [id=rtbassoc-00add6a16019a7b76]
aws_autoscaling_group.ASG01_NY: Refreshing state... [id=ASG01-NewYork-auto-scaling-group20250120184104850900000003]
aws_eip.eip_NY: Drift detected (update)
aws_launch_template.app1_NewYork_LT: Drift detected (update)
aws_autoscaling_group.ASG01_NY: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_autoscaling_attachment.ASG01_NY_attachment will be created
  + resource "aws_autoscaling_attachment" "ASG01_NY_attachment" {
      + alb_target_group_arn   = "arn:aws:elasticloadbalancing:us-east-1:261519058382:targetgroup/ASG01-NewYork-target-group/98be57dfe53e8914"
      + autoscaling_group_name = "ASG01-NewYork-auto-scaling-group20250120184104850900000003"
      + id                     = (known after apply)
    }

  # aws_autoscaling_policy.app1_NY_scaling_policy will be created
  + resource "aws_autoscaling_policy" "app1_NY_scaling_policy" {
      + arn                       = (known after apply)
      + autoscaling_group_name    = "ASG01-NewYork-auto-scaling-group20250120184104850900000003"
      + estimated_instance_warmup = 120
      + id                        = (known after apply)
      + metric_aggregation_type   = (known after apply)
      + name                      = "app1-cpu-target"
      + policy_type               = "TargetTrackingScaling"

      + target_tracking_configuration {
          + disable_scale_in = false
          + target_value     = 75

          + predefined_metric_specification {
              + predefined_metric_type = "ASGAverageCPUUtilization"
            }
        }
    }

  # aws_lb_listener.http_NY will be created
  + resource "aws_lb_listener" "http_NY" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:261519058382:loadbalancer/app/ASG01-NewYork-load-balancer/dcc5e91b8a764662"
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:261519058382:targetgroup/ASG01-NewYork-target-group/98be57dfe53e8914"
          + type             = "forward"
        }
    }

  # aws_route_table.private_NY will be created
  + resource "aws_route_table" "private_NY" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = "nat-0fdcd13a55506ed78"
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name" = "private_NY"
        }
      + tags_all         = {
          + "Name" = "private_NY"
        }
      + vpc_id           = "vpc-03bdc81ebb8aa64c0"
    }

  # aws_route_table_association.private-us-east-1a will be created
  + resource "aws_route_table_association" "private-us-east-1a" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-05e2095dd6c41961d"
    }

  # aws_route_table_association.private-us-east-1b will be created
  + resource "aws_route_table_association" "private-us-east-1b" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-0bec145c5fe625d73"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @statuc30721, Action: `pull_request`*